title=Int\u00e9gration du menu de navigation contextuel

blurb=<p class="jdl-paragraph">Jenkins se compose d'un graphe d'objets de domaine grand et complexe (<code>ModelObject</code>), o\u00f9 chaque n\u0153ud du graphe est une page web et o\u00f9 les ar\u00eates sont des hyperliens. Pour aider les utilisateurs \u00e0 naviguer rapidement dans ce graphe, Jenkins fournit un m\u00e9canisme pour attacher les menus contextuels aux objets de mod\u00e8le, qui peuvent \u00eatre utilis\u00e9s pour sauter plusieurs ar\u00eates sans passer par chacun des hyperliens interm\u00e9diaires.

define.title=D\u00e9finition du menu contextuel

blurb.define=<p class="jdl-paragraph">Pour d\u00e9finir un menu contextuel sur <code>ModelObject</code>, il faut impl\u00e9menter <a href="https://javadoc.jenkins.io/byShortName/ModelObjectWithContextMenu"><code>ModelObjectWithContextMenu</code></a>. Voir <a href="sourceFile/NavigationContextMenu.java">l'exemple</a> pour savoir comment impl\u00e9menter cette m\u00e9thode.

breadcrumb.title=Int\u00e9gration du fil d'Ariane

blurb.breadcrumb=<p class="jdl-paragraph">L'impl\u00e9mentation de <code>ModelObjectWithContextMenu</code> suffit pour que le c\u0153ur affiche le menu de contexte pour votre mod\u010dle objet dans le fil d'Ariane. Passez votre souris sur le fil d'Ariane de cette page pour voir le menu contextuel associ\u00e9 \u00e0 cet exemple. <p class="jdl-paragraph"> De plus, impl\u00e9menter <a href="https://javadoc.jenkins.io/jenkins/model/ModelObjectWithChildren.html"><code>ModelObjectWithChildren</code></a> vous permet d'afficher les enfants de votre objet mod\u00e8le dans le fil d'Ariane lorsque vous cliquez sur l'ic\u00f4ne '>' qui s\u00e9pare les \u00e9l\u00e9ments du fil d'Ariane.

hyperlink.title=Lien hypertexte du mod\u00e8le

blurb.modelLink=<p class="jdl-paragraph">En ajoutant la classe CSS "model-link" aux balises &lt;a> pointant vers les objets mod\u00e8les poss\u00e9dant un menu contextuel, vous pouvez activer le support du menu contextuel pour ce lien hypertexte. Par exemple :

blurb.modelLink.inside=<p class="jdl-paragraph">\u00c0 moins que l'hyperlien n'apparaisse en ligne, il est souvent pr\u00e9f\u00e9rable de pr\u00e9-allouer un espace pour l'ancrage du menu contextuel qui appara\u00eet lorsque la souris passe dessus. Pour cela, ajoutez \u00e9galement l'\u00e9l\u00e9ment CSS 'inside'. Par exemple\u00a0:


blurb.tltr=<p class="jdl-paragraph">Par d\u00e9faut, le menu contextuel appara\u00eet sous le lien, mais cela n'est pas pratique lorsque le mod\u00e8le de lien est align\u00e9 dans une liste verticale. Ajouter une classe CSS "tl-tr" suppl\u00e9mentaire (comprenez depuis en haut \u00e0 gauche du menu contextuel jusqu'\u00e0 en haut \u00e0 droite de l'ancrage cible) pour faire appara\u00eetre le menu contextuel \u00e0 droite.
